TEXTS_RU: dict[str, str] = {
    '/start':           'Приветствие',
    '/help':            'здесь будут правила',
    '/stats':           'здесь будет статистика',
    'new_game':         'Начало новой партии.\n\n'
                        'Вы играете {}.\n'
                        'Противник играет {}.\n'
                        'Уровень сложности ИИ: {}.',
    'white':            'белыми',
    'black':            'чёрными',
    'human_AI':         'Начало новой партии.\n'
                        'Играем против человека или ИИ?',
    'AI_level':         'Выберите уровень сложности ИИ',
    'start_position':   'Начинаем белыми или чёрными?',
    'not_ready':        'Эта функция пока не реализована.',
    'second_start':     'Вы уже начали партию. Завершить и сдаться?',
    'yield_Q':          'Признать поражение и закончить партию?',
    'white_move':       'Ход белых.',
    'black_move':       'Ход чёрных.',
    'win':              'Поздравляем с победой!',
    'lose':             'К сожалению, вы проиграли.',
    'draw':             'Ничья.',
    'checkmate':        'Шах и мат.',
    'stalemate':        'Патовая ситуация.',
    'ins_material':     'Недостаточно фигур для завершения партии.',
    'white_check':      'Белые ставят шах. ',
    'black_check':      'Чёрные ставят шах. ',
    'human_move':       'Ваш ход: ',
    'AI_move':          'Ход противника: ',
    'AI_move_label':    'ИИ думает над ходом',
    'other_answer':     'ЧТобы пользоваться ботом, пожалуйста. зарегистрируйтесь.'
    }

BUTTONS_RU: dict[str, str] = {
    'cancel_move':      'отменить последний ход',
    'yield':            'сдаться',
    'inline_mode':      'переключиться на кнопки',
    'console_mode':     'переключиться на текстовый ввод',
    'let_AI_move':      'разрешить АИ сделать ход',
    'against_human':    'против человека',
    'against_AI':       'против ИИ',
    'easy':             'Новичок',
    'med':              'Разрядник',
    'hard':             'Гроссмейстер',
    'white':            'белые',
    'black':            'чёрные',
    'yes_ds':           'Да, хочу начать новую партию.',
    'no_ds':            'Нет, хочу завершить текущую партию.',
    'yes_yield':        'Да, сдаться.',
    'no_yield':         'Нет, продолжать.'
    }

MENU_RU: dict[str, str] = {
    '/start_game':  'Запуск новой партии',
    '/help':        'Правила',
    '/stats':       'Статистика'
    }
